Repository: lolocomotive/stickers
Catalog: lib/l10n/app_*.arb
Languages: de, fr, ru

# appTitle
source: Sticker maker
de: Stickers
fr: Stickers
ru: Создатель стикеров

source: Title
de: Titel
fr: Titre
ru: Название

# pTitle
source: My sticker packs
de: Meine Packs
fr: Mes packs
ru: Мои наборы

source: Crop your sticker
de: Zuschneiden
fr: Recadrer
ru: Обрежьте стикер

source: Done
de: Fertig
fr: Valider
ru: Готово

source: No title
de: Unbenannt
fr: Sans titre
ru: Безымянный

source: Edit your sticker
de: Sticker bearbeiten
fr: Modifier
ru: Отредактируйте стикер

source: Add text layer
de: Textebene hinzufügen
fr: Ajouter un texte
ru: Добавьте слой текста

source: Select sticker pack
de: Pack auswählen
fr: Choisir un pack
ru: Выберите набор стикеров

source: You need at least 3 stickers
de: Ein Pack muss mindestens 3 Sticker enthalten
fr: Il faut au moins 3 stickers
ru: Необходимо как минимум 3 стикера

source: You can't have more than 30 stickers
de: Ein Pack kann maximal 30 Sticker enthalten
fr: Il ne peut pas y avoir plus de 30 stickers par pack
ru: Нельзя иметь больше 30 стикеров

source: Add to WhatsApp
de: Zu WhatsApp Hinzufügen
fr: Ajouter à WhatsApp
ru: Добавить в WhatsApp

source: Click on the bottom right to add a sticker pack
de: Unten rechts klicken um ein Stickerpack hinzuzufügen
fr: Clique en bas à droite pour ajouter un pack
ru: Нажмите внизу справа чтобы добавить набор стикеров

source: No packs
de: Keine Stickerpacks
fr: Pas de packs
ru: Нет наборов

source: Settings
de: Einstellungen
fr: Paramètres
ru: Настройки

source: Theme
de: Farbschema
fr: Thème
ru: Тема

source: System
fr: Système
ru: Системная

source: Light
de: Hell
fr: Clair
ru: Светлая

source: Dark
de: Dunkel
fr: Sombre
ru: Темная

# settings_quickmode_description
source: Adds shared images as stickers automatically without any interaction
de: Fügt geteilte Bilder direkt als Sticker zu WhatsApp hinzu ohne weitere Interaktion
fr: Ajoute des images partagées à l'application automatiquement, sans interaction supplémentaire
ru: Добавляет общие изображения как стикеры автоматически

source: Quick mode defaults
de: Schnell-Modus Konfigurieren
fr: Configuration mode rapide
ru: Настройки по умолчанию для быстрого режима

source: Edit
de: Bearbeiten
fr: Modifier
ru: Редактировать

source: About
de: Info
fr: À propos
ru: Информация

source: Licences
de: Lizenzen
ru: Лицензии

source: Create sticker pack
de: Stickerpack erstellen
fr: Créer un pack
ru: Создать набор стикеров

source: Pack title
de: Stickerpack-Titel
fr: Titre du pack
ru: Название набора

source: Author
de: Autor
fr: Auteur
ru: Автор

source: Cancel
de: Abbrechen
fr: Annuler
ru: Отмена

source: Add
de: Hinzufügen
fr: Ajouter
ru: Добавить

source: Delete
de: Löschen
fr: Supprimer
ru: Удалить

source: Edit sticker pack
de: Stickerpack bearbeiten
fr: Modifier le pack
ru: Отредактировать набор стикеров

source: Publisher website
de: Webseite des Herausgebers
fr: Site web de l'auteur
ru: Сайт автора

source: Privacy policy website
de: Webseite der Datenschutzerklärung
fr: Site web de la politique de confidentialité
ru: Сайт с политикой конфиденциальности

source: License agreement website
de: Webseite der Lizenzvereinbarung
fr: Site web des CGU
ru: Сайт с лицензионным соглашением

source: More
de: Mehr
fr: Plus
ru: Ещё

source: Please enter a valid URL
de: Bitte geben Sie eine gültige URL ein
fr: Veuillez entrer une URL valide
ru: Пожалуйста, введите правильный URL

source: Change pack icon
de: Symbol ändern
fr: Changer l'icône du pack
ru: Сменить иконку набора

source: Choose existing sticker
de: Bestehenden Sticker benutzen
fr: Choisir un sticker existant
ru: Выбрать существующий стикер

source: Create new
de: Neuen Sticker erstellen
fr: Créer un nouveau sticker
ru: Создать новый

source: Edit defaults
de: Standardeinstellungen bearbeiten
fr: Modifier les paramètres par défaut
ru: Изменить настройки по умолчанию

source: Default title
de: Standardtitel
fr: Titre par défaut
ru: Стандартное название

source: Default author
de: Standardautor
fr: Auteur par défaut
ru: Стандартный автор

source: Confirm
de: Bestätigen
fr: Confirmer
ru: Подтвердить

source: Edit sticker
de: Sticker bearbeiten
fr: Modifier le sticker
ru: Отредактировать стикер

source: Associated emojis
de: Zugehörige Emojis
fr: Émoticônes associés
ru: Ассоцирующиеся эмоджи

source: Delete sticker
de: Sticker löschen
fr: Supprimer le sticker
ru: Удалить стикер

source: Please provide at least one emoji
de: Geben Sie mindestens ein Emoji ein
fr: Veuillez entrer au moins un émoticône
ru: Выберите хотя бы один эмоджи

source: Please provide at most 3 emojis
de: Geben Sie maximal 3 Emojis ein
fr: Veuillez entrer au plus 3 émoticônes
ru: Выберите не более трех эмоджи

source: Please enter only emojis
de: Geben Sie nur Emojis ein
fr: Veuillez entrer seulement des émoticônes
ru: Вводите только эмоджи

source: Couldn't add sticker pack
de: Hinzufügen fehlgeschlagen
fr: Ajout échoué
ru: Нельзя добавить набор стикеров

source: Ok :(
ru: Ок :(

source: Choose a sticker
de: Sticker auswählen
fr: Sélectionner un Sticker
ru: Выберите стикер

source: Quick mode
de: Schnell-Modus
fr: Mode rapide
ru: Быстрый режим

source: Language
de: Sprache
fr: Langue
ru: Язык

# pleaseEnterTitle
source: Please enter a title
de: Geben Sie einen Titel ein
fr: Veuillez entrer un titre
ru: Введите навание

# pleaseEnterAuthor
source: Please enter an author
de: Geben Sie einen Autor ein
fr: Veuillez entrer un auteur
ru: Введите автора

# sourceOnGithub
source: The source code for this app is available on GitHub under a GPL 3.0 License. Report bugs, request features or make a donation there.
de: Der Quellcode dieser App ist unter einer GPL 3.0 Lizenz auf GitHub verfügbar. Melden Sie Fehler, machen Sie Verbesserungsvorschläge oder unterstützen Sie das Projekt hier.
fr: Le code source de cette application est disponible sous licence GPL 3.0 sur GitHub. Signalez les bugs, suggérez des améliorations ou faites un don ici.
ru: Исходный код есть на GitHub под лицензией GPL 3.0. Рассказывайте о багах и идеях или поддержите денежкой.

# addToPack
source: Add to sticker pack
de: Zum Stickerpack hinzufügen
fr: Ajouter au pack
ru: Добавить в набор стикеров

# checkIfFileValid
source: Check if the provided file is valid.
de: Bitte überprüfen Sie, ob die gegebene Datei gültig ist.
fr: Veuillez vérifier si le fichier est valide.
ru: Убедитесь, что файл не поврежден и является файлом стикеров.

# importError
source: Couldn't import pack
de: Pack konnte nicht importiert werden
fr: Erreur lors de l'import
ru: Нельзя импортировать этот файл набора стикеров

# unrecognizedFormat
source: Unrecognized file format
de: Unbekanntes Dateiformat
fr: Format de fichier non reconnu
ru: Формат файла не опозан

# onlyPacksAndImagesRecognized
source: Only sticker packs or images are supported at the moment.
de: Es werden zur Zeit nur Bilder und Stickerpacks unterstützt
fr: Seulement les packs de stickers et les images sont pris en charge actuellement
ru: Поддерживаются только файлы наборов стикеров и изображений.

# whatsappNotInstalled
source: WhatsApp is not installed
de: WhatsApp ist nicht installiert
fr: WhatsApp n'est pas installé
ru: WhatsApp не установлен

source: Delete {pack}?
de: {pack} löschen?
fr: Supprimer {pack}?
ru: Удалить {pack}?

source: Draw
de: Zeichnen
fr: Dessiner
ru: Рисовать

source: Add Text
de: Text hinzufügen
fr: Ajouter du texte
ru: Добавить текст

source: Undo
de: Rückgängig
fr: Annuler
ru: Отменить

source: Redo
de: Wiederherstellen
fr: Refaire
ru: Восстановить

source: Export
de: Exportieren
fr: Exporter
ru: Экспорт

source: Import
de: Importieren
fr: Importer
ru: Импорт

# couldntImportPack
source: Couldn't import sticker pack
de: Stickerpack konnte nicht importiert werden
fr: Erreur lors de l'import du pack
ru: Нельзя импортировать набор стикеров

# checkPack
source: Check if the file is a valid sticker pack file
de: Überprüfen Sie ob die Datei eine gültige Stickerpack-Datei ist
fr: Veuillez vérifier si le fichier du pack est valide.
ru: Убедитесь что это верный файл набора стикеров

# selectPack
source: Select a sticker pack
de: Ein Stickerpack auswählen
fr: Sélectionner un pack de stickers
ru: Выберите набор стикеров

source: Create Pack
de: Pack erstellen
fr: Créer le pack
ru: Создать набор стикеров

# cannotAddToAnimated
source: Cannot add stickers to animated packs (yet)
de: Es können keine sticker zu animierten Packs hinzugefügt werden
fr: Impossible d'ajouter des stickers à un pack animé
ru: Нельзя добавлять анимированные стикеры (пока что)

source: Leave editor?
de: Editor verlassen?
fr: Quitter l'éditeur?
ru: Покинуть редактор?

# editsNotSaved
source: Your edits won't be saved
de: Änderungen werden nicht gespeichert
fr: Les changements ne seront pas sauvegardés
ru: Ваши изменения не будут сохранены

source: Stay
de: Bleiben
fr: Rester
ru: Остаться

source: Leave
de: Verlassen
fr: Quitter
ru: Выйти

source: More fonts
de: Mehr Schriftarten
fr: Plus de polices
ru: Еще шрифты

source: Font
de: Schriftart
fr: Police
ru: Шрифт

source: Font size
de: Schriftgröße
fr: Taille de police
ru: Размер шрифта

source: Color
de: Farbe
fr: Couleur
ru: Цвет

source: Outline
de: Umriss
fr: Contour
ru: Контур

source: Pick a color
de: Farbe auswählen
fr: Choisir une couleur
ru: Выбрать цвет

# staticPack
source: Static
de: Statisch
fr: Statique
ru: Статичный

# animatedPack
source: Animated
de: Animiert
fr: Animé
ru: Анимированный

source: Off
de: Aus
fr: Désactivé
ru: Выкл.

source: Adjust
de: Anpassen
fr: Ajuster
ru: Настроить

source: New color:
de: Neue Farbe:
fr: Nouvelle couleur:
ru: Новый цвет:

# cropTooSmall
source: Crop area too small
de: Bildausschnitt zu klein
fr: Zone de recadrage trop petite
ru: Область обрезки слишком мала

# cropTooSmallDetails
source: Must be at least 1x1 pixel
de: Muss mindestens 1x1 Pixel groß sein
fr: Doit être d'au moins 1x1 pixel
ru: Должно быть не менее 1x1 пикселя

source: Exporting
de: Exportieren
fr: Exportation
ru: Экспорт

source: Couldn't export sticker
de: Sticker konnte nicht exportiert werden
fr: Impossible d'exporter le sticker
ru: Не удалось экспортировать стикер

source: Error message:
de: Fehlermeldung:
fr: Message d'erreur:
ru: Сообщение об ошибке:

source: First attempt
de: Erster Versuch
fr: Premier essai
ru: Первая попытка

# secondAttempt
source: Result too big, re-encoding with lower quality
de: Ergebnis zu groß, wird mit geringerer Qualität exportiert
fr: Résultat trop gros, réencodage avec une qualité inférieure
ru: Результат слишком велик, повторная кодировка с более низким качеством

# thirdAttempt
source: Last attempt
de: Dritter Versuch
fr: Dernier essai
ru: Последняя попытка

# exportWebpFailed
source: Exporting to WebP failed
de: WebP-Export fehlgeschlagen
fr: Échec de l'exportation en WebP
ru: Экспорт в WebP не удался

# exportWebpFailedMsg
source: Try again, or with another sticker. If the issue persists, submit an issue on GitHub.
de: Versuchen Sie es erneut oder mit einem anderen Sticker. Wenn das Problem weiterhin besteht, melden Sie es auf GitHub.
fr: Réessayez, ou utilisez un autre sticker. Si le problème persiste, signalez-le sur GitHub.
ru: Попробуйте снова или с другим стикером. Если проблема сохраняется, сообщите об ошибке на GitHub.

source: Sticker too large
de: Sticker zu groß
fr: Sticker trop gros
ru: Стикеры слишком большие

# stickerTooLargeMsg
source: Even when encoding at very low quality settings, the sticker still exceeds the maximum size requirement of 512kB. Please use a shorter video.
de: Selbst bei einer sehr niedrigen Qualitätseinstellung überschreitet der Sticker die maximale Größe von 512 kB. Bitte verwenden Sie ein kürzeres Video.
fr: Même avec des paramètres de qualité très bas, l'autocollant dépasse toujours la taille maximale requise de 512 Ko. Veuillez utiliser une vidéo plus courte.
ru: Даже при кодировке с очень низким качеством стикер превышает максимальный размер в 512 кБ. Пожалуйста, используйте более короткое видео.

source: Fonts manager
de: Schriftarten-Manager
fr: Gestionnaire de polices
ru: Менеджер шрифтов

source: Add more
de: Mehr hinzufügen
fr: Ajouter plus
ru: Добавить еще

source: Display name
de: Anzeigename
fr: Nom d'affichage
ru: Отображаемое имя

source: Privacy notice
de: Datenschutzhinweis
fr: Avis de confidentialité
ru: Уведомление о конфиденциальности

# privacyNoticeText
source: This feature uses the free Google Fonts service to offer you many new fonts for your stickers. If you continue, the app will connect to Google to load the fonts. During this process, technical data like your IP address will be transmitted.
de: Diese Funktion nutzt den kostenlosen Dienst Google Fonts, um neue Schriftarten für Sticker anzubieten. Wenn Sie fortfahren, stellt die App eine Verbindung zu Google her, um die Schriftarten zu laden. Während dieses Vorgangs werden technische Daten wie Ihre IP-Adresse übertragen.
fr: Cette fonctionnalité utilise le service gratuit Google Fonts pour vous proposer de nombreuses nouvelles polices pour vos stickers. Si vous continuez, l'application se connectera à Google pour charger les polices. Au cours de ce processus, des données techniques telles que votre adresse IP seront transmises.
ru: Эта функция использует бесплатный сервис Google Fonts, чтобы предложить вам новые шрифты для стикеров. Если вы продолжите, приложение подключится к Google для загрузки шрифтов. В процессе будут переданы технические данные, такие как ваш IP-адрес.

source: More info
de: Mehr Info
fr: Plus d'infos
ru: Подробнее

source: Continue
de: Weiter
fr: Continuer
ru: Продолжить

source: Search for fonts
de: Nach Schriftarten suchen
fr: Chercher des polices
ru: Поиск шрифтов

source: Error
de: Fehler
fr: Erreur
ru: Ошибка

source: Already downloaded
de: Bereits heruntergeladen
fr: Déjà téléchargé
ru: Уже загружено

# errorDownloadingPreview
source: Error downloading font preview
de: Fehler beim Laden der Vorschau
fr: Échec du téléchargement de l'aperçu
ru: Ошибка загрузки предпросмотра шрифта

source: Download {item}?
de: {item} herunterladen?
fr: Télécharger {item}?
ru: Загрузить {item}?

source: Downloading...
de: Herunterladen...
fr: Téléchargement...
ru: Загрузка...

source: Download
de: Herunterladen
fr: Télécharger
ru: Загрузить

source: Couldn't load media
de: Medium konnte nicht geladen werden
fr: Impossible de charger le média
ru: Не удалось загрузить медиа

source: Couldn't load video
de: Video konnte nicht geladen werden
fr: Impossible de charger la vidéo
ru: Не удалось загрузить видео

source: Trim video
de: Video zuschneiden
fr: Couper la vidéo
ru: Обрезать видео

# trimFailed
source: Video trimming failed
de: Zuschneiden fehlgeschlagen
fr: Échec du coupage de la vidéo
ru: Не удалось обрезать видео

# trimFailedMsg
source: Try another video, and if it still doesn't work, head to GitHub to submit an Issue
de: Versuchen Sie es mit einem anderen Video. Wenn es immer noch nicht funktioniert, gehen Sie zu GitHub, um ein Problem zu melden
fr: Essayez une autre vidéo, et si cela ne fonctionne toujours pas, rendez-vous sur GitHub pour signaler un problème
ru: Попробуйте другое видео, и если не сработает, перейдите на GitHub, чтобы отправить отчет об ошибке

# fontsManagerDetails
source: Add/remove fonts of the app
de: Schriftarten zur App hinzufügen oder entfernen
fr: Ajouter/supprimer des polices de l'application
ru: Добавление/удаление шрифтов приложения

source: Clear cache
de: Cache leeren
fr: Vider le cache
ru: Очистить кэш

# thisWillRestart
source: This will restart the app
de: Die App wird dabei neu gestartet
fr: Ceci redémarrera l'application
ru: Приложение будет перезапущено
